---
kind: method
id: M:Autodesk.Revit.DB.BoundaryValidation.Dispose
source: html/a6a9cd7e-9079-8b55-638b-36e40398597b.htm
---
# Autodesk.Revit.DB.BoundaryValidation.Dispose Method

Releases all resources used by the BoundaryValidation

## Syntax (C#)
```csharp
public void Dispose()
```